examples/coupled_sedifoam_granlammps/test_single_cgs/openfoam/constant/environmentalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version	 2.0;
	format	 ascii;
	class	 dictionary;
	object	 environmentalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

g 			 g [0 1 -2 0 0 0 0] (0 -981.0 0);

// ************************************************************************* //
