examples/coupled_sedifoam_granlammps/test_single_cgs/openfoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       13900;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       14000;
    }
    streamwiseIn
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          500;
        startFace       14100;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  streamwiseOut;
    }
    streamwiseOut
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          500;
        startFace       14600;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  streamwiseIn;
    }
    front
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          500;
        startFace       15100;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back;
    }
    back
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          500;
        startFace       15600;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front;
    }
)

// ************************************************************************* //
